Table of Contents
 Class ConnectionCheckRes
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Results for connection in project
[Serializable]
[DataContract]
public class ConnectionCheckRes
Inheritance
object
ConnectionCheckRes
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ConnectionCheckRes()
public ConnectionCheckRes()
Properties
 BucklingResults
List of results of buckling analysis
[DataMember]
public List<BucklingRes> BucklingResults { get; set; }
Property Value
List<BucklingRes>
 CheckResAnchor
List of check results for anchors
[DataMember]
public List<CheckResAnchor> CheckResAnchor { get; set; }
Property Value
List<CheckResAnchor>
 CheckResBolt
List of check results for bolts
[DataMember]
public List<CheckResBolt> CheckResBolt { get; set; }
Property Value
List<CheckResBolt>
 CheckResConcreteBlock
List of check results for concrete blocks
[DataMember]
public List<CheckResConcreteBlock> CheckResConcreteBlock { get; set; }
Property Value
List<CheckResConcreteBlock>
 CheckResPlate
List of check results for plates
[DataMember]
public List<CheckResPlate> CheckResPlate { get; set; }
Property Value
List<CheckResPlate>
 CheckResSummary
List of CheckResSummary
[DataMember]
public List<CheckResSummary> CheckResSummary { get; set; }
Property Value
List<CheckResSummary>
 CheckResWeld
List of check results for welds
[DataMember]
public List<CheckResWeld> CheckResWeld { get; set; }
Property Value
List<CheckResWeld>
 ConnectionID
Guid of connection
[DataMember]
public Guid ConnectionID { get; set; }
Property Value
Guid
 Messages
Gets or sets the list of errors, that apears during validation and/or calculation.
[DataMember]
public OpenMessages Messages { get; set; }
Property Value
OpenMessages
 Name
Name of connection
[DataMember]
public string Name { get; set; }
Property Value
string
 Edit this page